# Ex2 - GroupBy

### Step 1. Import the necessary libraries

In [31]:
import pandas as pd
import numpy as np

### Step 2. 
User ***Jupyter Lab*** to view ``../../DATA/drinks.cvs``.

### Step 3. Assign it to a variable called drinks.

In [32]:
drinks = pd.read_csv('../../DATA/drinks.csv')

### Step 4. Which continent drinks the most beer on average?

In [33]:
grouped = drinks.groupby('continent')
grouped.mean()['beer_servings'].idxmax()

'EU'

### Step 5. For each continent print the statistics for wine consumption.

In [37]:
grouped['wine_servings'].agg([np.min,np.max,np.mean,np.sum,np.std,np.var,np.median])

           amin  amax        mean   sum        std          var  median
continent
AF            0   233   16.264151   862  38.846419  1509.044267     2.0
AS            0   123    9.068182   399  21.667034   469.460359     1.0
EU            0   370  142.222222  6400  97.421738  9490.994949   128.0
OC            0   212   35.625000   570  64.555790  4167.450000     8.5
SA            1   221   62.416667   749  88.620189  7853.537879    12.0

### Step 6. Print the mean alcoohol consumption per continent for every column

In [38]:
grouped.mean()

,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol
continent,,,,
AF,61.471698,16.339623,16.264151,3.007547
AS,37.045455,60.840909,9.068182,2.170455
EU,193.777778,132.555556,142.222222,8.617778
OC,89.687500,58.437500,35.625000,3.381250
SA,175.083333,114.750000,62.416667,6.308333

### Step 7. Print the median alcoohol consumption per continent for every column

In [41]:
grouped.median()

,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol
continent,,,,
AF,32.0,3.0,2.0,2.30
AS,17.5,16.0,1.0,1.20
EU,219.0,122.0,128.0,10.00
OC,52.5,37.0,8.5,1.75
SA,162.5,108.5,12.0,6.85

### Step 8. Print the mean, min and max values for spirit consumption.
#### This time output a DataFrame

In [62]:
# mean, max and min per country
mean = drinks['spirit_servings'].mean()
min = drinks['spirit_servings'].min()
max = drinks['spirit_servings'].max()

print('mean: ',mean)
print('min: ',min)
print('max: ',max)

pd.DataFrame({'alcohol':["spirit"],
              'mean':[mean],
              'min':[min],
              'max':[max]      
             })

mean:  80.99481865284974
min:  0
max:  438

  alcohol       mean  min  max
0  spirit  80.994819    0  438

In [76]:
#max,min and mean per continent
grouped['spirit_servings'].agg([np.min,np.max,np.mean])

           amin  amax        mean
continent
AF            0   152   16.339623
AS            0   326   60.840909
EU            0   373  132.555556
OC            0   254   58.437500
SA           25   302  114.750000